#include<stdio.h>
#include<stdlib.h>
#include<locale.h>
#include<math.h>

void main()
{
	setlocale(LC_ALL, "Rus");


	int n = 0;
	printf("введите нз: ");
	scanf("%d", &n);


	if (n == 1) {
		/* 1.	Дано натуральное (целое неотрицательное) число, а и целое положительное число d.
		Вычислить частное q и остаток r при делении, а на d*/

		int a, d, q;
		float r;
		printf("a=");
		scanf("%d", &a);
		printf("d=");
		scanf("%d", &d);

	







	}